In [52]:
import pandas as pd

In [53]:
data = pd.read_csv("titanic.csv")

In [54]:
data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [55]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace=True)
data.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [56]:
y = data.Survived
x = data.drop('Survived',axis='columns')

In [57]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [58]:
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [59]:
dummies = pd.get_dummies(x.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [60]:
x = pd.concat([x,dummies],axis='columns')
x.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [61]:
x.drop('Sex',axis='columns',inplace=True)
x.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [62]:
x.Age = x.Age.fillna(x.Age.mean())
x.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [63]:
from sklearn.model_selection import train_test_split

In [64]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [65]:
from sklearn.tree import DecisionTreeClassifier

In [66]:
tree = DecisionTreeClassifier(random_state=42)

In [67]:
tree.fit(x_train, y_train)

DecisionTreeClassifier(random_state=42)

In [68]:
from sklearn.metrics import accuracy_score

In [69]:
y_pred = tree.predict(x_test)

In [70]:
accuracy = accuracy_score(y_test, y_pred)

In [71]:
print("Accuracy of the Decision Tree Classifier:",accuracy)

Accuracy of the Decision Tree Classifier: 0.7653631284916201

In [81]:
def modified_decision_tree(age, fare):
    if age >= 60 or fare < 20:
        return 0  # "Not Survived"
    else:
        return 1  # "Survived"

In [82]:
y_pred_modified = [modified_decision_tree(age, fare) for age, fare in zip(x_test["Age"], x_test["Fare"])]

In [83]:
accuracy_modified = accuracy_score(y_test, y_pred_modified)
print("Accuracy of the modified model:", accuracy_modified)

Accuracy of the modified model: 0.6871508379888268